//УстановитьТело из файла, из потока, из строки   
Функция getMessage(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.УстановитьТелоИзСтроки("HelloWorld");
	Возврат Ответ;
КонецФункции

Функция getMessage2(Запрос)
	ТекстОтвета = "Hello World! ";
	
	Для Каждого ПараметрАдреса Из Запрос.ПараметрыURL Цикл
		ТекстОтвета = ТекстОтвета + СтрШаблон("ПараметрыURL. ключ: %1, значение: %2", ПараметрАдреса.Ключ, ПараметрАдреса.Значение) + Символы.ПС;
	КонецЦикла;	
	
	Ответ = Новый HTTPСервисОтвет(200);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
	Ответ.Заголовки = Заголовки;
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
КонецФункции

//http://localhost/http_servis/hs/helloworld/home/admin?text=привет от меня
//http://localhost/http_servis/hs/helloworld/home/admin?text=привет от меня&date=true&email=true
//http://localhost/http_servis/hs/helloworld/home/admin?email=true
//не получилось
Функция getMessage3(Запрос)
	ТекстПараметровЗапроса = "";
	Сообщение = Запрос.ПараметрыЗапроса.Получить("text");
	Если ЗначениеЗаполнено(Сообщение) Тогда
		ТекстПараметровЗапроса = ТекстПараметровЗапроса + "Сообщение: " + Сообщение + Символы.ПС;
	КонецЕсли;	
	ПризнакДаты = Запрос.ПараметрыЗапроса.Получить("date");
	Если ЗначениеЗаполнено(ПризнакДаты) И ПризнакДаты = "true" Тогда
		ТекстПараметровЗапроса = ТекстПараметровЗапроса + "сегодня: " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + Символы.ПС;
	КонецЕсли;
	ПризнакПочты = Запрос.ПараметрыЗапроса.Получить("email");
	Если ЗначениеЗаполнено(ПризнакДаты) И ПризнакДаты = "true" Тогда
		ТекстПараметровЗапроса = ТекстПараметровЗапроса + "email: " + "foo@bar.ru" + Символы.ПС;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекстПараметровЗапроса) Тогда
		ТекстОтвета = ТекстОтвета + ТекстПараметровЗапроса;
	КонецЕсли;
КонецФункции

Функция getWord(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/vnd.openxmlformats-officedocument.wordprocessingml.document");
	Ответ.Заголовки = Заголовки;
	Ответ.УстановитьТелоИзДвоичныхДанных(ПолучитьОбщийМакет("word"));
	Возврат Ответ;
КонецФункции

Функция ПолучитьОбъектОтвета(СтруктураВходныхПараметров)
	// Дальше разбираем структуру входных параметров, формируем запрос остатков с указанием фильтров, и результат упаковываем снова в JSON
	// В качестве примера вернем тестовые данные
	Остатки = Новый Массив;
	СтруктураТоваров = Новый Структура("goods, qty", "0001", 15);
	Остатки.Добавить(СтруктураТоваров);
	Возврат Остатки;
КонецФункции

Функция POSTstocks(Запрос)
	ФорматОтвета = Запрос.ПараметрыURL.Получить("format");
	Если ФорматОтвета = "json" тогда
		
		СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		СтруктураВходныхПараметров = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
	    ОбъектОтвета = ПолучитьОбъектОтвета(СтруктураВходныхПараметров);
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
		ЗаписатьJSON(ЗаписьJSON, ОбъектОтвета);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
	ИначеЕсли ФорматОтвета = "xml" тогда
		// тут код для формирования ответа в xml 
	ИначеЕсли ФорматОтвета = "csv" тогда
		// тут код для формирования ответа в csv 
	Иначе
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("неизвестный формат данных!");
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;

КонецФункции
