&НаСервере
Процедура РазобратьJWTНаСервере()
	
	//JWT представляет собой base64-закодированный  JSON, состоящий из трех частей, разделенных точкой.
	МассивЧастей = СтрРазделить(Токен, ".");
	Заголовок64 = МассивЧастей[0];
	Содержимое64 = МассивЧастей[1];
	Подпись = МассивЧастей[2];
	
	ЭлементыТокена = СтрРазделить(Токен, ".");
	Если ЭлементыТокена.Count() <> 3 Тогда
		Возврат;
	КонецЕсли;
	
	Содержимое64 = ЭлементыТокена[1];
	
	ЗаголовокСтрока = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеЭлементаТокенаJWT(Заголовок64));
	Содержимое = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеЭлементаТокенаJWT(Содержимое64));
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Содержимое);
	СодержимоеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеЭлементаТокенаJWT(Знач Значение)
	
	Значение = СтрЗаменить(Значение, "-", "+");
	Значение = СтрЗаменить(Значение, "_", "/");
	
	Остаток = СтрДлина(Значение) % 4;
	
	Если Остаток = 1 Тогда
		Возврат Неопределено;
	ИначеЕсли Остаток = 2 Тогда
		Значение = Значение + "==";
	ИначеЕсли Остаток = 3 Тогда
		Значение = Значение + "=";
	КонецЕсли;
	
	Возврат Base64Значение(Значение);
	
КонецФункции 

&НаКлиенте
Процедура РазобратьJWT(Команда)
	РазобратьJWTНаСервере();
КонецПроцедуры


&НаСервере
Процедура СгенерироватьТокенНаСервере()
	АлгоритмПодписи = АлгоритмПодписиТокенаДоступа.HS256;
    ТокенДоступа = Новый ТокенДоступа;
    ТокенДоступа.Заголовки.Вставить("alg", Строка(АлгоритмПодписи));
    ТокенДоступа.Эмитент = "ssl"; // на момент публикации указание других эмитентов делает токен нерабочим
    
    МассивПолучателей = Новый Массив;
    МассивПолучателей.Добавить("HelloWorld"); // имя http-сервиса из default.vrd
    ТокенДоступа.Получатели = МассивПолучателей;

    ТокенДоступа.КлючСопоставленияПользователя = ИмяПользователя; //Имя пользователя ИБ строкой
	//Один из вариантов получения времени UTC 
    ТокенДоступа.ВремяСоздания = Дата(1,1,1) + ТекущаяУниверсальнаяДатаВМиллисекундах()/1000 - Дата(1970,1,1,1,0,0);;
    ТокенДоступа.ВремяЖизни = 31536000; 
    ТокенДоступа.Идентификатор = Новый УникальныйИдентификатор;
	//вторым параметром нужно указать строку в Base64 кодировке. Можно сгенерировать ее сторонним сервисом или средствами 1С
    ТокенДоступа.Подписать(АлгоритмПодписи, Base64Строка(ПолучитьДвоичныеДанныеИзСтроки("Секретный ключ нужно прописать в vrd")));
	
    Токен = Строка(ТокенДоступа); // при получении токена строкой он автоматически преобразуется в Base64Url	
КонецПроцедуры	


&НаКлиенте
Процедура СгенерироватьТокен(Команда)
	СгенерироватьТокенНаСервере();
КонецПроцедуры

